In [3]:
import pandas as pd
#CreateasampleemployeeDataFrame
data={ 'EmployeeID':[101,102,103,104,105], 'Name':['Alice', 'Bob', 'Charlie', 'David', 'Eve'], 'Age':[28,32,29,35,26] } 
df=pd.DataFrame(data) 
#DisplaytheinitialDataFrame 
print("InitialDataFrame:")
print(df) 
#Let'ssayyouwanttodeletetherowfortheemployeenamed'Charlie' 
employee_to_delete='Charlie' 
#Usethe.locpropertytodeletetherowbasedontheemployee'sname 
df=df.loc[df['Name']!=employee_to_delete] 
#DisplaytheDataFrameafterdeletingtherow 
print("\nDataFrameafterdeletingtherowfor'Charlie':") 
print(df)

InitialDataFrame:
   EmployeeID     Name  Age
0         101    Alice   28
1         102      Bob   32
2         103  Charlie   29
3         104    David   35
4         105      Eve   26

DataFrameafterdeletingtherowfor'Charlie':
   EmployeeID   Name  Age
0         101  Alice   28
1         102    Bob   32
3         104  David   35
4         105    Eve   26

In [7]:
import pandas as pd
# Create a sample employee DataFrame
data = { 'EmployeeID': [101, 102, 103, 104, 105], 'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],'Age': [28, 32, 29, 35, 26], 'Photo': ['photo1.jpg', 'photo2.jpg', 'photo3.jpg', 'photo4.jpg', 'photo5.jpg'] }
df = pd.DataFrame(data)
# Display the initial DataFrame
print("Initial DataFrame:")
print(df)
# Delete the 'Photo' column (employee photos are no longer needed)
df = df.drop('Photo', axis=1)
# Display the DataFrame after deleting the column
print("\nDataFrame after deleting the 'Photo' column:") 
print(df)

Initial DataFrame:
   EmployeeID     Name  Age       Photo
0         101    Alice   28  photo1.jpg
1         102      Bob   32  photo2.jpg
2         103  Charlie   29  photo3.jpg
3         104    David   35  photo4.jpg
4         105      Eve   26  photo5.jpg

DataFrame after deleting the 'Photo' column:
   EmployeeID     Name  Age
0         101    Alice   28
1         102      Bob   32
2         103  Charlie   29
3         104    David   35
4         105      Eve   26

In [9]:
import pandas as pd 
#CreateasamplesalesDataFrame
data={ 'OrderID':[101,102,103,104,105], 'Product':['Widget', 'Gadget', 'Widget', 'Doodad', 'Widget'], 'Quantity':[10,5,0,7,15], 'Status':['Shipped', 'Canceled', 'Canceled', 'Shipped', 'Shipped'] }
df=pd.DataFrame(data) 
#DisplaytheinitialDataFrame 
print("InitialDataFrame:") 
print(df) 
#Deleterowswheretheorderstatusis'Canceled'
df=df[df['Status']!='Canceled']
# Display the DataFrame after deleting rows
print("\nDataFrame after deleting 'Canceled' orders:")
print(df)

InitialDataFrame:
   OrderID Product  Quantity    Status
0      101  Widget        10   Shipped
1      102  Gadget         5  Canceled
2      103  Widget         0  Canceled
3      104  Doodad         7   Shipped
4      105  Widget        15   Shipped

DataFrame after deleting 'Canceled' orders:
   OrderID Product  Quantity   Status
0      101  Widget        10  Shipped
3      104  Doodad         7  Shipped
4      105  Widget        15  Shipped

In [13]:
# CSV------------------------------------------------
''' how to create and store a CSV file '''
import pandas as pd
#CreateaPandasDataFrame 
data={ 'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25,30,35] } 
df=pd.DataFrame(data) 
#SpecifythefilepathtosavetheCSVfile 
csv_file_path='output.csv'
#WritetheDataFrametoaCSVfile
df.to_csv(csv_file_path, index=False)
#thiswillcreateanewfileinthecurrent folder 
print(f'Data has been written to{csv_file_path}')

Data has been written tooutput.csv

In [19]:
data=pd.read_csv('output.csv')
data

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [27]:
data=pd.read_csv('output.csv',nrows=2)
data

    Name  Age
0  Alice   25
1    Bob   30

In [29]:
data=pd.read_csv('output.csv',nrows=2,usecols=["Name","Age"])
data

    Name  Age
0  Alice   25
1    Bob   30

In [33]:
# data=pd.read_csv('output.csv',nrows=2,usecols=["Name"])
data=pd.read_csv('output.csv',nrows=2,usecols=[0])
data

    Name
0  Alice
1    Bob

In [39]:
import pandas as pd 
df=pd.read_csv('output.csv')
df.head(1)

    Name  Age
0  Alice   25

In [41]:
df=pd.read_csv("output.csv")
df.columns
df.describe()

        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [43]:
df=pd.read_csv('output.csv')
df[1:4]

      Name  Age
1      Bob   30
2  Charlie   35

In [45]:
import pandas as pd
column_names = ['Name','Age']
data = pd.read_csv('output.csv', names= column_names, header=0)
print("Dataframe information")
print(data.info())
print("Dataframe Description")
print(data.describe())

Dataframe information
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes
None
Dataframe Description
        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0